// Задача 34: Задайте массив заполненный случайными положительными трёхзначными числами. Напишите программу, 
//которая покажет количество чётных чисел в массиве.

//345, 897, 568, 234] -> 2
/*int size = 10;// Размер массива - определем 10
int minVuale = 100;// Минимальное трехзначное число
int maxVuale = 1000;//Максимальное число +1=1000
int count = 0;//count - счетчик четных чисел
int [] GetArray(int size, minVuale, maxVuale)// Задаем метод GetArray. Не пойму где ошибка, говорит, что "GetArray" объявлена, 
                                            //но не используется, не все пути к коду возвращают значение.
{
    int i = 0;// i - индекс массива
    int [] resalt = new int [size];// Создаем массив
    resalt [i] = new Random().Next(minVuale, maxVuale);// Заполняем массив случайными числами в нужном диапазоне
    if (resalt [i] % 2 = 0)//Определяем четное ли число
    {
        count++;// Включаем счетчик четных чисел
    }
    for (int i = 0; i<= size; i++ )
    {

    }
    return resalt;
}
Console.WriteLine($"количество чётных чисел в массиве сотавляет - + {count}");
*/

//Задача 36: Задайте одномерный массив, заполненный случайными числами. Найдите сумму элементов, стоящих на нечётных позициях.

//[3, 7, 23, 12] -> 19

//[-4, -6, 89, 6] -> 0
/*int size = 5;// Размер массива - определем 5
int minVuale = 1;// Минимальное  число
int maxVuale = 11;//Максимальное число 
int [] GetArray(int size, minVuale, maxVuale)// Не пойму где ошибка, говорит, что "GetArray" объявлена, 
                                            //но не используется, не все пути к коду возвращают значение.
{
    int sum = 0;//sum - определяем переменную суммы
    int i = 0;// i - индекс массива
    int [] array = new int [size];// Создаем массив
    array [i] = new Random().Next(minVuale, maxVuale);// Заполняем массив случайными числами в нужном диапазоне
    for (int i = 0; i<= size; i++ )
    {
        if  (int (i % 2) = 0)//Определяем четное ли число, постоянно пишет ошибку, то инт не то? то i не определено
        {
            int sum + = array [i];// Ссумируем четные элементы массива
        }
    }
    return array;
}
Console.WriteLine($"Cумма элементов, стоящих на нечётных позициях - + {sum}");
*/
//Задача 38: Задайте массив вещественных чисел. Найдите разницу между максимальным и минимальным элементов массива.
// [3 7 22 2 78] -> 76

/*int i;
int size = 10;// Задаем размер массива? у нас он равен 5
Double [] array = new Double [size];// Создаем массив
array [i] = new Random().NextDouble(0 , 1);//Заполняем массив значениями, пишет ошибку
Double Min = array [0];
Double Max = array [0];
Double Dif;
for (int i = 0; i<= size; i++ )// Пишет ошибку
{
    array [i] = array [i] * 10;//Приводим массив в приемлемый вид
    if (array [i] < Min);
    {
        Min = array [i];//Определяем минимальный элемент массива
    }
    if (array [i] > Max);
    {
         Max = array [i];//Определяем максимальный элемент массива
    }
}

double Max - double Min == double Dif;//Определяем разницу, опять ошибка
Console.WriteLine($"Разница между мкксимальным и минимальным элементом массива равна - + {double Dif}");//Печатаем разницу, опять ошибка
*/
/*
Доп. задачка:
Задача 37: Найдите произведение пар чисел в одномерном массиве. Парой считаем первый и последний элемент, 
//второй и предпоследний и т.д. Результат запишите в новом массиве.
[1 2 3 4 5] -> 5 8 3
[6 7 3 6] -> 36 21
*/
/*
int size = 10;// Размер массива - определем 10
int min = 0;
int max = size;
int minVuale = 1;// Минимальное трехзначное число
int maxVuale = 10;//Максимальное число +1=1000
int count = 0;//count - счетчик четных чисел
int [] array = new int [size];// Создаем массив
array [i] = new Random().Next(minVuale, maxVuale);// Заполняем массив случайными числами в нужном диапазоне
int [] array2 = new int [size/2];
int j = 0;
array2 [j]=;
int [] GetSumArray(int size, minVuale, maxVuale)
{
   for (int j = 0; j<= size/2; j ++ )
   {
    array2 [j] == array [min]*array [max];
    min ++;
    max --;
    Console.WriteLine("array2 [j]");
   }
   return array;
}
*/
